EDT_2/src/Documents/ПоступлениеТоваров/ПоступлениеТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеТоваров</name>
  <registerRecords>InformationRegister.ЦеныПоставщиков</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиНоменклатуры</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT_2/src/Enums/ВидыТоваров/ВидыТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыТоваров</name>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
  <enumValues>
    <name>Материал</name>
  </enumValues>
</mdclass:Enum>

EDT_2/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ДляПереноса</name>
      <description>Для переноса</description>
    </items>
  </predefined>
  <attributes>
    <name>ЦенаПокупки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаПродажи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидНоменклатуры</name>
    <type>
      <types>EnumRef.ВидыТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>ОснЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
</mdclass:Catalog>

EDT_2/src/Documents/ПоступлениеТоваров/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура КоличествоПриИзменении(Элемент)

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЦенуНоменклатуры(Номенклатура)
	
	Возврат Номенклатура.ЦенаПокупки;

КонецФункции

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	
	Стр = Элементы.Товары.ТекущиеДанные;
	Стр.Цена=ПолучитьЦенуНоменклатуры(Стр.Номенклатура);
	КоличествоПриИзменении(Элемент);
	
КонецПроцедуры


&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	ТекущийЭлемент = Элементы.Склад;
	
КонецПроцедуры


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	МассивПроверяемыхТоваров = Новый Массив;
	Для каждого ТекСтр Из Объект.Товары Цикл
	    МассивПроверяемыхТоваров.Добавить(ТекСтр.Номенклатура);
	КонецЦикла; 
	
	МассивНайденыхУслуг = ПолучитьМассивУслугВТабличнойЧастиТовары(МассивПроверяемыхТоваров);
	Если МассивНайденыхУслуг.Количество()<>0 Тогда
			Сообщить("В табличной части товары найдены услуги. Документ не может быть записан!");
			Для каждого НазваниеУслуги Из МассивНайденыхУслуг Цикл
			  Сообщить(НазваниеУслуги + " является услугой.");
			КонецЦикла; 
		    Отказ = Истина;
	КонецЕсли; 
КонецПроцедуры



&НаСервереБезКонтекста
Функция ПолучитьМассивУслугВТабличнойЧастиТовары(МассивПроверяемыхТоваров)

	МассивВозвращаемыхУслуг = Новый Массив;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Наименование
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка В(&МассивТоваров)
		|	И Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыТоваров.Услуга)";

	Запрос.УстановитьПараметр("МассивТоваров", МассивПроверяемыхТоваров);
	
	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		МассивВозвращаемыхУслуг.Добавить(ВыборкаДетальныеЗаписи.Наименование);
	КонецЦикла;

    возврат МассивВозвращаемыхУслуг;
КонецФункции // ()
